src/cf/Catalogs/ДокументыУдостоверяющиеЛичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ДокументыУдостоверяющиеЛичность</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ДокументыУдостоверяющиеЛичность/Ext/ManagerModule.bsl
Процедура ЗаполнитьПоУмолчанию() Экспорт
	Макет=Справочники.ДокументыУдостоверяющиеЛичность.ПолучитьМакет("КлассификаторИМНС");
	Таблица=Новый ТабличныйДокумент;
	Таблица.Вывести(Макет);
	Для НомерСтроки=4 По Таблица.ВысотаТаблицы Цикл
		КодИФНС=Таблица.Область(НомерСтроки, 2, НомерСтроки, 2).Текст; //Код ИФНС
		СправочникСсылка=Справочники.ДокументыУдостоверяющиеЛичность.НайтиПоКоду(КодИФНС);
		Если СправочникСсылка.Пустая() Тогда
			СправочникОбъект=Справочники.ДокументыУдостоверяющиеЛичность.СоздатьЭлемент();
			СправочникОбъект.Код=КодИФНС;
		Иначе
			СправочникОбъект=СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;
		СправочникОбъект.КодИМНС=КодИФНС;
		СправочникОбъект.КодПФР=Таблица.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
		СправочникОбъект.Наименование=Таблица.Область(НомерСтроки, 4, НомерСтроки, 4).Текст;		
		СправочникОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
